### Import Required Libraries

In [1]:
import pandas as pd
import numpy as np

### Load Dataset

In [4]:
consumers=pd.read_csv(r"C:\Users\HP\Documents\Restaurant_Ratings_Analysis\Consumers.csv")
preferences=pd.read_csv(r"C:\Users\HP\Documents\Restaurant_Ratings_Analysis\Consumer_Preferences.csv")
restaurants=pd.read_csv(r"C:\Users\HP\Documents\Restaurant_Ratings_Analysis\Restaurants.csv")
ratings=pd.read_csv(r"C:\Users\HP\Documents\Restaurant_Ratings_Analysis\Ratings.csv")
cuisines=pd.read_csv(r"C:\Users\HP\Documents\Restaurant_Ratings_Analysis\Restaurant_Cuisines.csv")

### Initial Data Inspection

In [5]:
consumers.head()

,Consumer_ID,City,State,Age,Gender,Occupation,Marital_Status,Smoker,Drink_Level,Budget_Level,Transport_Mode
0,C00001,Mumbai,Maharashtra,27,Female,Employed,Single,No,Casual,Medium,Bike
1,C00002,Delhi,Delhi,34,Male,Business,Married,Yes,Social,High,Car
2,C00003,Bengaluru,Karnataka,24,Female,Student,Single,No,Non,Low,Public Transport
3,C00004,Chennai,Tamil Nadu,30,Male,Employed,Married,No,Casual,Medium,Bike
4,C00005,Hyderabad,Telangana,37,Female,Business,Married,Yes,Social,High,Car

In [6]:
consumers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Consumer_ID     5000 non-null   object
 1   City            5000 non-null   object
 2   State           5000 non-null   object
 3   Age             5000 non-null   int64
 4   Gender          5000 non-null   object
 5   Occupation      5000 non-null   object
 6   Marital_Status  5000 non-null   object
 7   Smoker          5000 non-null   object
 8   Drink_Level     5000 non-null   object
 9   Budget_Level    5000 non-null   object
 10  Transport_Mode  5000 non-null   object
dtypes: int64(1), object(10)
memory usage: 429.8+ KB

In [7]:
consumers.describe()

               Age
count  5000.000000
mean     31.166400
std       7.601517
min      21.000000
25%      24.000000
50%      30.500000
75%      37.000000
max      46.000000

In [8]:
preferences.head()

  Consumer_ID Preferred_Cuisine
0      C00001            Indian
1      C00002           Chinese
2      C00003      South Indian
3      C00004      North Indian
4      C00005       Street Food

In [9]:
preferences.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Consumer_ID        5000 non-null   object
 1   Preferred_Cuisine  5000 non-null   object
dtypes: object(2)
memory usage: 78.3+ KB

In [10]:
preferences.describe()

       Consumer_ID Preferred_Cuisine
count         5000              5000
unique        5000                 8
top         C05000            Indian
freq             1               625

In [11]:
restaurants.head()

,Restaurant_ID,Restaurant_Name,City,State,Country,Price_Range,Pure_Veg,Alcohol_Served,Parking,Franchise,Online_Delivery
0,R00001,Delight Dhaba,Pune,Maharashtra,India,Low,No,Full Bar,Public,No,Yes
1,R00002,Delight Cafe,Chandigarh,Chandigarh,India,Low,No,No,Public,Yes,Yes
2,R00003,Plaza Kitchen,Delhi,Delhi,India,High,No,Full Bar,Private,No,No
3,R00004,House Restaurant,Patna,Bihar,India,Medium,No,Beer & Wine,Private,Yes,Yes
4,R00005,Heritage Palace,Bengaluru,Karnataka,India,Medium,Yes,No,Public,No,Yes

In [12]:
restaurants.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Restaurant_ID    5000 non-null   object
 1   Restaurant_Name  5000 non-null   object
 2   City             5000 non-null   object
 3   State            5000 non-null   object
 4   Country          5000 non-null   object
 5   Price_Range      5000 non-null   object
 6   Pure_Veg         5000 non-null   object
 7   Alcohol_Served   5000 non-null   object
 8   Parking          4176 non-null   object
 9   Franchise        5000 non-null   object
 10  Online_Delivery  5000 non-null   object
dtypes: object(11)
memory usage: 429.8+ KB

In [13]:
restaurants.describe()

,Restaurant_ID,Restaurant_Name,City,State,Country,Price_Range,Pure_Veg,Alcohol_Served,Parking,Franchise,Online_Delivery
count,5000,5000,5000,5000,5000,5000,5000,5000,4176,5000,5000
unique,5000,160,20,14,1,3,2,3,3,2,2
top,R05000,Heritage Palace,Pune,Uttar Pradesh,India,High,No,No,Public,No,Yes
freq,1,43,275,749,5000,1706,2504,3350,1673,2532,4170

In [14]:
ratings.head()

,Consumer_ID,Restaurant_ID,Overall_Rating,Food_Rating,Service_Rating,Value_for_Money
0,C00001,R03681,4,4,3,4
1,C00002,R00349,4,4,5,3
2,C00003,R02274,3,2,3,5
3,C00004,R00297,3,3,2,3
4,C00005,R04163,3,5,3,2

In [15]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Consumer_ID      5000 non-null   object
 1   Restaurant_ID    5000 non-null   object
 2   Overall_Rating   5000 non-null   int64
 3   Food_Rating      5000 non-null   int64
 4   Service_Rating   5000 non-null   int64
 5   Value_for_Money  5000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 234.5+ KB

In [16]:
ratings.describe()

       Overall_Rating  Food_Rating  Service_Rating  Value_for_Money
count     5000.000000  5000.000000     5000.000000      5000.000000
mean         3.486400     3.498400        3.467000         3.484600
std          0.707612     1.105189        1.134182         1.128547
min          2.000000     2.000000        2.000000         2.000000
25%          3.000000     3.000000        2.000000         2.000000
50%          3.000000     4.000000        3.000000         3.000000
75%          4.000000     4.000000        5.000000         5.000000
max          5.000000     5.000000        5.000000         5.000000

In [17]:
cuisines.head()

  Restaurant_ID Cuisine_Type
0        R00001       Bakery
1        R00002      Seafood
2        R00003     Gujarati
3        R00004      Bengali
4        R00005    Fast Food

In [18]:
cuisines.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Restaurant_ID  5000 non-null   object
 1   Cuisine_Type   5000 non-null   object
dtypes: object(2)
memory usage: 78.3+ KB

In [19]:
cuisines.describe()

       Restaurant_ID Cuisine_Type
count           5000         5000
unique          5000           25
top           R05000      Mughlai
freq               1          221

### Remove Duplicate Records

In [20]:
consumers.duplicated().sum()

np.int64(0)

In [21]:
restaurants.duplicated().sum()

np.int64(0)

In [22]:
ratings.duplicated().sum()

np.int64(0)

### Handle Missing Values

In [23]:
consumers.isnull().sum()

Consumer_ID       0
City              0
State             0
Age               0
Gender            0
Occupation        0
Marital_Status    0
Smoker            0
Drink_Level       0
Budget_Level      0
Transport_Mode    0
dtype: int64

In [24]:
restaurants.isnull().sum()

Restaurant_ID        0
Restaurant_Name      0
City                 0
State                0
Country              0
Price_Range          0
Pure_Veg             0
Alcohol_Served       0
Parking            824
Franchise            0
Online_Delivery      0
dtype: int64

In [25]:
ratings.isnull().sum()

Consumer_ID        0
Restaurant_ID      0
Overall_Rating     0
Food_Rating        0
Service_Rating     0
Value_for_Money    0
dtype: int64

## The data is Cleand

## Load Data from Python INTO SQL

In [26]:
pip install sqlalchemy mysql-connector-python

Requirement already satisfied: sqlalchemy in c:\users\hp\anaconda3\lib\site-packages (2.0.39)
Collecting mysql-connector-python
  Downloading mysql_connector_python-9.5.0-cp313-cp313-win_amd64.whl.metadata (7.7 kB)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\hp\anaconda3\lib\site-packages (from sqlalchemy) (4.12.2)
Downloading mysql_connector_python-9.5.0-cp313-cp313-win_amd64.whl (16.5 MB)
   ---------------------------------------- 0.0/16.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/16.5 MB ? eta -:--:--
    --------------------------------------- 0.3/16.5 MB ? eta -:--:--
    --------------------------------------- 0.3/16.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/16.5 MB 985.5 kB/s eta 0:00:17
   -- ------------------------------------- 1.0/16.5 MB 1.2 MB/s eta 0:00:13
   --- ------------------------------------ 1.3/16.5 MB 1.4 MB/s eta 0:00:12
   ---- ----------------------------------- 1.8/16.5 MB 1.4 MB/s eta 0:00:11
   ----- ---------------------------------- 2.1/16.5 MB 1.5 MB/s eta 0:00:10
   ------ --------------------------------- 2.9/16.5 MB 1.7 MB/s eta 0:00:09
   ------- -------------------------------- 3.1/16.5 MB 1.7 MB/s eta 0:00:08
   -------- ------------------------------- 3.7/16.5 MB 1.8 MB/s eta 0:00:08
   ---------- ----------------------------- 4.5/16.5 MB 1.9 MB/s eta 0:00:07
   ------------ --------------------------- 5.0/16.5 MB 2.0 MB/s eta 0:00:06
   ------------- -------------------------- 5.8/16.5 MB 2.1 MB/s eta 0:00:06
   --------------- ------------------------ 6.6/16.5 MB 2.2 MB/s eta 0:00:05
   ----------------- ---------------------- 7.3/16.5 MB 2.3 MB/s eta 0:00:04
   -------------------- ------------------- 8.4/16.5 MB 2.4 MB/s eta 0:00:04
   ---------------------- ----------------- 9.4/16.5 MB 2.6 MB/s eta 0:00:03
   ------------------------ --------------- 10.2/16.5 MB 2.6 MB/s eta 0:00:03
   -------------------------- ------------- 10.7/16.5 MB 2.6 MB/s eta 0:00:03
   -------------------------- ------------- 11.0/16.5 MB 2.6 MB/s eta 0:00:03
   --------------------------- ------------ 11.3/16.5 MB 2.5 MB/s eta 0:00:03
   --------------------------- ------------ 11.3/16.5 MB 2.5 MB/s eta 0:00:03
   --------------------------- ------------ 11.3/16.5 MB 2.5 MB/s eta 0:00:03
   --------------------------- ------------ 11.5/16.5 MB 2.2 MB/s eta 0:00:03
   --------------------------- ------------ 11.5/16.5 MB 2.2 MB/s eta 0:00:03
   ---------------------------- ----------- 11.8/16.5 MB 2.1 MB/s eta 0:00:03
   ----------------------------- ---------- 12.3/16.5 MB 2.1 MB/s eta 0:00:02
   ------------------------------ --------- 12.6/16.5 MB 2.1 MB/s eta 0:00:02
   ------------------------------- -------- 12.8/16.5 MB 2.1 MB/s eta 0:00:02
   ------------------------------- -------- 13.1/16.5 MB 2.0 MB/s eta 0:00:02
   --------------------------------- ------ 13.6/16.5 MB 2.0 MB/s eta 0:00:02
   ---------------------------------- ----- 14.2/16.5 MB 2.1 MB/s eta 0:00:02
   ------------------------------------ --- 14.9/16.5 MB 2.1 MB/s eta 0:00:01
   ------------------------------------- -- 15.5/16.5 MB 2.1 MB/s eta 0:00:01
   ---------------------------------------  16.3/16.5 MB 2.1 MB/s eta 0:00:01
   ---------------------------------------- 16.5/16.5 MB 2.1 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.5.0
Note: you may need to restart the kernel to use updated packages.

In [27]:
from sqlalchemy import create_engine

In [28]:
engine = create_engine("mysql+mysqlconnector://root:2005@localhost/restaurant_analysis")

## Load DataFrames into SQL Tables

In [29]:
consumers.to_sql("consumers", engine, if_exists="replace", index=False)

5000

In [30]:
preferences.to_sql("consumer_preferences", engine, if_exists="replace", index=False)

5000

In [31]:
restaurants.to_sql("restaurants", engine, if_exists="replace", index=False)

5000

In [32]:
ratings.to_sql("ratings", engine, if_exists="replace", index=False)

5000

In [33]:
cuisines.to_sql("restaurant_cuisines", engine, if_exists="replace", index=False)

5000